Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: All other radixes must either rely on the constant folding properties of ordinary multiplication and exponentiation, or supply the equivalent two numbers as part of the string, which will be interpreted as they would outside the string, that is, as decimal numbers by default:
ja: 他の全ての根は普通の掛け算と累乗の定数畳込みプロパティに頼らなければならないか、デフォルトで十進数として、文字列（それらが文字列の外でそうして、それは解釈される）の一部として、つまり、等価2番号を供給しなければならない：

source: It's true that only radixes that define e as a digit are ambiguous that way, but with any radix it's not clear whether the exponentiator should be 10 or the radix, and this makes it explicit:
ja: 桁としてeを定義する根だけがそのようにあいまいであるというのは本当である、しかし、何か根で、exponentiatorが10か根でなければならないかどうかは明らかでない、そして、これは明示的にする：

source: So we write those as
ja: 我々がそれらを書くように、

source: The generic string-to-number converter will recognize all of these forms (including the * form, since constant folding is not available to the run time).
ja: 一般的な数への文字列コンバータは、これらの形（*の形を含む、定数畳込みが実行時が利用できない時から）の全てを認知する。

source: Also allowed in strings are leading plus or minus, and maybe a trailing Units type for an implied scaling.
ja: また、入れられた文字列は、意味されたスケーリングのためにプラスまたはマイナスと多分後置単位型を導いているだろう。

source: Leading and trailing whitespace is ignored.
ja: 主要なおよび後置空白文字は無視される。

source: Note also that leading 0 by itself never implies octal in Perl 6.
ja: また、主要な0がPerl 6で８進を単独で決して意味しない点に注意しなさい。

source: In all these cases, the type produced will be the narrowest of Int, Rat, or Num that can accurately represent the number.
ja: すべてのこれらのケースに、生み出される型は、Int、Ratまたは数を正確に表現することができるNumで最も狭い。

source: If no type can represent it exactly, it should be returned as either a Rat or a Num, whichever is more accurate.
ja: 型が必ずしもそれを表現することができないならば、それはRatかNum（より正確であるものはどれでも）として返納印でなければならない。

source: (Rat64 will tend to be more accurate for numbers of normal or large magnitude, while Num64 may be more accurate for numbers of very small magnitude, since the Rat's size mismatch of numerator and denominator will eventually cost more accuracy than the Num's exponent overhead.
ja: （Ratが分子のサイズ不適当な組合せである時から、Num64が非常に少ない大きさの番号のためにより正確である場合がある間、Rat64は通常であるかかなりの大きさの番号のためにより正確な傾向がある、そして、結局、分母はNumが頭上で主唱者であるより多くの正確さを犠牲にする。

source: As a limiting case, a Rat64 cannot represent any number smaller than :10&lt;1*2**-64&gt;.)
ja: 制限的なケースとして、Rat64は:10&lt;1*2**-64&gt;より少ない何か数を表現することができない。）

source: A consequence of the preceding is that you cannot make a FatRat using colon notation.
ja: 先立つ結果は、あなたがFatRatをコロン表記法を使用しているようにすることができないということである。

source: You must rely on constructors and constant folding:
ja: あなたは、コンストラクタと定数畳込みに頼らなければならない：

source: Conversion functions
ja: 転換関数

source: Any of the adverbial forms may be used as a function:
ja: 副詞形のどれでも、関数として使われるかもしれない：

source: Think of these as setting the default radix, not forcing it.
ja: それを強制しなくて、デフォルト根をセットするように、これらについて考えなさい。

source: Like Perl 5's old oct() function, any of these will recognize a number starting with a different radix marker and switch to the other radix.
ja: Perl 5の古いoct()が機能するように、これらのどれでも異なる根目印から始めている数を認知して、他の根に変わる。

source: However, note that the :16() converter function will interpret leading 0b or 0d as hex digits, not radix switchers.
ja: しかし、:16()コンバータ関数が主要な0bまたは0dを16進数（根スイッチャでない）と解釈する点に注意しなさい。

source: Use of the functional form on anything that is not a string will throw an exception explaining that the user has confused a number with the textual representation of a number.
ja: 文字列でない何の関数形式の使用でも、ユーザーが数を数の原文の表現と混同したと説明している例外を投げる。

source: This is to catch errors such as a :8(777) that should have been :8&lt;777&gt;, or the attempt to use the function in reverse to produce a textual representation from a number.
ja: これは、エラー（例えば:8&lt;777&gt;でなければならなかった:8(777)または原文の代表を数から作り出すために逆に関数を使う試み）を捕えることである。

source: Rational literals
ja: 合理的なリテラル

source: Rational literals are indicated by separating two integer literals (in any radix) with a slash, and enclosing the whole in angles:
ja: 合理的なリテラルは、スラッシュで2つの整数リテラル（何か根の）を切り離して、全体を角度に入れることによって示される：

source: Whitespace is not allowed on either side of the slash or it will be split under normal quote-words semantics:
ja: 空白文字はスラッシュの両側に許されない、または、それは通常の引用-ワード意味論の下で割られる：

source: Because of constant folding, you may often get away with leaving out the angles:
ja: 定数畳込みのため、あなたは角度を無視してしばしば逃げのびるかもしれない：

source: However, in that case you have to pay attention to precedence and associativity.
ja: しかし、その場合、あなたは優先順位と結合性に注意を払わなければならない。

source: The following does not cube 2/3:
ja: 以下は、2/3をさいの目にしない：

source: Decimal fractions not using &quot;e&quot; notation are also treated as literal Rat values:
ja: 「e」表記法を使用していない小数は、文字通りのRat値ともみなされる：

source: Literals specified in angle brackets are always subject to val() processing, so &lt;1/2&gt; produces a value that is both a Rat and a Str.
ja: かぎ括弧で指定されているリテラルは常にval()処理を受けるので、&lt;1/2&gt;はRatとStrである値を生じる。

source: See &quot;Allomorphic value semantics&quot; below.
ja: 下記の「Allomorphic値意味論」を見なさい。

source: Complex literals
ja: 複雑なリテラル

source: Complex literals are similarly indicated by writing an addition or subtraction of two real numbers (again, without spaces around the operators) inside angles:
ja: 複雑なリテラルは、2実数の追加または引き算を書くことによって、同じように示される再び、スペースが演算子のあたりになくて、（）角度の中に：

source: As with rational literals, constant folding would produce the same complex number, but this form parses as a single term, ignoring surrounding precedence.
ja: 合理的なリテラルと同様に、定数畳込みは同じ複素数を生じる、しかし、この形はシングルとして項を解析する。そして、周囲の優先順位を無視する。

source: (Note that these are not actually special syntactic forms:
ja: （これらが実際に特別な構文法の形でないことに注意すべきである：

source: both rational and complex literal forms fall out naturally from the semantic rules of qw quotes described below.)
ja: 合理的で複雑な文字通りの形は、以下に記すqw引用の意味規則から、自然に運ぶ。）

source: Literals specified in angle brackets are always subject to val() processing, so &lt;1+2i&gt; produces a value that is both a Complex and a Str.
ja: かぎ括弧で指定されているリテラルは常にval()処理を受けるので、&lt;1+2i&gt;はComplexとStrである値を生じる。

source: Blob literals
ja: Blobリテラル

source: Blob literals look similar to integer literals with radix markers, but use curlies instead of angles:
ja: Blobリテラルは根目印で整数リテラルと類似しているように見えるが、角度の代わりにcurliesを使う：

source: Whitespace and underscores are allowed but ignored.
ja: 空白文字とアンダーラインは、許されるが、無視される。

source: Radix interpolation
ja: 根展開

source: Characters indexed by hex numbers can be interpolated into strings by introducing with &quot;\x&quot;, followed by either a bare hex number (&quot;\x263a&quot;) or a hex number in square brackets (&quot;\x[263a]&quot;).
ja: 十六進数によって索引付けされる文字は&quot;\x&quot;で持ち出すことによって文字列に改変されることができる。そして、角括弧（&quot;\x[263a]&quot;）でぎりぎりの十六進数（&quot;\x263a&quot;）か十六進数が続く。

source: Similarly, &quot;\o12&quot; and &quot;\o[12]&quot; interpolate octals--but generally you should be using hex in the world of Unicode.
ja: 同様に、&quot;\o12&quot;と&quot;\o[12]&quot;は８進を差し込む－しかし、通常、あなたはユニコードの世界で16進法を使用していなければならない。

source: Multiple characters may be specified within any of the bracketed forms by separating the numbers with comma:
ja: 複数の文字は、コンマで数を切り離すことによって、括弧に入れられた形のどれの範囲内ででも指定されるかもしれない：

source: You must use the bracketed form to disambiguate if the unbracketed form would &quot;eat&quot; too many characters, because all of the unbracketed forms eat as many characters as they think look like digits in the radix specified.
ja: unbracketedされた形の全てがそれらが根で桁のような観察が指定されたと考えるのと同じくらい多くの文字を食べるので、あなたはunbracketedされた形があまりに多くの文字を「食べる」ならば、曖昧さをなくす括弧に入れられた形を使用しなければならない。

source: None of these notations work in normal Perl code.
ja: これらの表記法のどれも、通常のPerlコードで動かない。

source: They work only in interpolations and regexes and the like.
ja: それらは、展開と正規表現などだけで動く。

source: Note that the inside of the brackets is not an expression, and you may not interpolate there, since that would be a double interpolation.
ja: ブラケットの内部が表現でないことに注意すべきである、そして、それが二重の補間法である時から、そこで改竄しなくてもよい。

source: Use curlies to interpolate the values of expressions.
ja: 表現の値を差し込むために、curliesを使いなさい。

source: The old \123 form is now illegal, as is the \0123 form.
ja: \0123ができられているように、古い\123の形は現在無効である。

source: Only \0 remains, and then only if the next character is not in the range '0'..'7'.
ja: \0だけは残る、そして、次がある場合だけ、文字は範囲'0'..'7'でない。

source: Octal characters must use \o notation.
ja: ８進の文字は、\o表記法を使用しなければならない。

source: Note also that backreferences are no longer represented by \1 and the like--see S05.
ja: また、後方参照が\1などによってもはや表現されない点に注意しなさい－S05を見なさい。

source: Angle quotes (quote words)
ja: 角度は、引用する（ワードを引合いに出す）

source: The qw/foo bar/ quote operator now has a bracketed form:
ja: qw/foo bar/引用演算子には、現在括弧に入れられた形がある：

source: When used as a subscript it performs a slice equivalent to 'foo','bar'.
ja: 添え字として使われるとき、それは'foo','bar'に等しいスライスを実行する。

source: Elsewhere it is equivalent to a parenthesized list of strings:
ja: どこかほかで、それは文字列の括弧に入れられたリストに等しい：

source: Since parentheses are generally reserved just for precedence grouping, they merely autointerpolate in flat list context.
ja: 括弧が通常、ちょうど優先順位グループのために予約されているので、それらは単に平らなリストコンテキストでautointerpolateするだけである。

source: Therefore
ja: したがって、

source: is equivalent to:
ja: 以下に等しい：

source: which is the same as:
ja: そしてそれは以下と同じようにある：

source: In item context, the implied grouping parentheses are still there, so
ja: アイテム前後関係では、そう、意味されたグループ括弧は、まだそこにある

source: which assigns a Parcel to the variable.
ja: そしてそれはParcelを変数に割り当てる。

source: On the other hand, if you backslash the parcel:
ja: 他方で、もしもである、あなたバックスラッシュは、パーセルである：

source: it is like:
ja: それは、以下のようにある：

source: and ends up storing a Capture object (which weeds out any named arguments into a separate structure, in contrast to a Parcel, which keeps everything in its original list).
ja: そして、Captureオブジェクト（Parcelと対照的に、すべてをその元のリストに保つ別構造に少しも名をつけられた引数を除く）を格納することの上の端。

source: Binding is different from assignment.
ja: バインディングは、割当てと異なる。

source: If bound to a signature, the &lt;a b&gt; parcel will be promoted to a Capture object, but if bound to a parameter, it will make the flattening/slicing decision based on the nature of the individual parameter.
ja: シグネチャに密接に結びつくならば、&lt;a b&gt;パーセルはCaptureオブジェクトに昇進させられる、しかし、パラメータに密接に結びつくならば、それは個々のパラメータの性質に基づく平らになっている/スライス決定をする。

source: That is, if you pass &lt;a b&gt; as an argument, it will bind as a single item to a positional or slice parameter, and as two items to a slurpy parameter.
ja: つまり、あなたが引数として&lt;a b&gt;を通過するならば、それは位置またはスライスパラメータへの一つのアイテムとして、そして、slurpyパラメータへの2つのアイテムとして結合する。

source: But note that under the parenthesis-rewrite rule, a single value will still act like a single value.
ja: しかし、括弧-書き換え規則の下で、一つの値がまだ一つの値のようなふりをする点に注意しなさい。

source: These are all the same:
ja: これらは、それでもなお以下の通りである：

source: Strings within angle brackets are subject to val() processing, and any component that parses successfully as a numeric literal will become both a string and a number.
ja: かぎ括弧の範囲内の文字列はval()処理を受ける、そして、それが数値リテラルとしてうまく解析する何か構成要素は文字列と数になる。

source: Explicit Parcel construction
ja: 明示的パーセル構築

source: As the previous section shows, a parcel is not automatically constructed by parens;
ja: 前のセクションショーとして、パーセルは括弧によって自動的に造られない;

source: the parcel is actually constructed by the comma, not by the parens.
ja: 括弧によってでなく、パーセルは実はコンマによって造られる。

source: To force a single value to become a composite object in item context, either add a comma inside parens, or use an appropriate constructor or composer for clarity as well as correctness:
ja: 一つの値にアイテム前後関係のコンポジットオブジェクトになることを強制するために、括弧内部にコンマを加えるか、明快さならびに正しさのために適切なコンストラクタまたはコンポーザーを使いなさい：

source: Disallowed forms
ja: 認められなかった形

source: The degenerate case &lt;&gt; is disallowed as a probable attempt to do IO in the style of Perl 5;
ja: 退歩したケース&lt;&gt;は、Perl 5のスタイルでイオをまねる見込みがある試みとして認められない;

source: that is now written lines().
ja: それは、現在lines()を書かれる。

source: (&lt;STDIN&gt; is also disallowed.) Empty lists are better written with () in any case because &lt;&gt; will often be misread as meaning ('').
ja: ('')を意味するように&lt;&gt;がしばしば読み誤られるので、空きリストはいずれにせよ()でより上手に書かれる（&lt;STDIN&gt;も認められない。）。

source: (Likewise the subscript form %foo&lt;&gt; should be written %foo to avoid misreading as @foo''.) If you really want the angle form for stylistic reasons, you can suppress the error by putting a space inside:
ja: 文体の理由のために角度の形態を本当に望むならば、あなたはスペースを以下に入れることによってエラーを抑えることができる（同様に、下に書かれた形%foo&lt;&gt;は@foo''として読み違いを避けるために%fooを書かれなければならない。）：

source: Relationship between &lt;&gt; and ≪≫
ja: &lt;&gt;と≪≫の関係

source: Much like the relationship between single quotes and double quotes, single angles do not interpolate while double angles do. The double angles may be written either with French quotes, ≪$foo @bar[]≫, or with &quot;Texas&quot; quotes, &lt;&lt;$foo @bar[]&gt;&gt;, as the ASCII workaround.
ja: 非常にシングルクォートとダブルクォート（二重山形がそうする間、角度が差し込まないシングル）の関係ような。二重山形は、フランスの引用（≪$foo @bar[]≫）で、または、ASCII回避方法としてのテキサス引用（&lt;&lt;$foo @bar[]&gt;&gt;）で書かれるかもしれない。

source: The implicit split is done after interpolation, but respects quotes in a shell-like fashion, so that ≪'$foo' &quot;@bar[]&quot;≫ is guaranteed to produce a list of two &quot;words&quot; equivalent to ('$foo', &quot;@bar[]&quot;).
ja: 潜在的な分裂は展開の後されるが、耳ファッションで引用を尊重する、そのため、≪'$foo' &quot;@bar[]&quot;≫は('$foo', &quot;@bar[]&quot;)に2つのワード等価物のリストを生産すると保証される。

source: Pair notation is also recognized inside ≪...≫ and such &quot;words&quot; are returned as Pair objects.
ja: Pair表記法は≪...≫の中にも認知される、そして、そのようなワードはPairオブジェクトとして返納印である。

source: Colon pairs (but not arrow pairs) are recognized within double angles.
ja: コロン組（しかし、矢組でなく）は、二重山形の中で認知される。

source: In addition, the double angles allow for comments beginning with #.
ja: そのうえ、二重山形は、#から始めているコメントを考慮に入れる。

source: These comments work exactly like ordinary comments in Perl code.
ja: これらのコメントは、Perlコードで普通のコメントのように正確に動く。

source: Unlike in the shells, any literal # must be quoted, even ones without whitespace in front of them, but note that this comes more or less for free with a colon pair like :char&lt;#x263a&gt;, since comments only work in double angles, not single.
ja: シェルではとは異なり、何か文字通りの#は空白文字がそれらの前にない引合いに出された、均一なものでなければならないが、これがコメントが二重山形で動くだけの時から:char&lt;#x263a&gt;のようなコロン一組とともに多少無料で来る点に注意しなければならない。そして、独りでない。

source: Adverbial Pair forms
ja: 副詞の一組の形

source: There is now a generalized adverbial form of Pair notation.
ja: 一組表記法の全般的な副詞形が、現在ある。

source: The following table shows the correspondence to the &quot;fatarrow&quot; notation:
ja: 以下のテーブルは、「fatarrow」表記法との類似を示す：

source: The fatarrow construct may be used only where a term is expected because it's considered an expression in its own right, since the fatarrow itself is parsed as a normal infix operator (even when autoquoting an identifier on its left).
ja: fatarrow自体が通常のインフィックスオペレータ（その左で識別子をautoquotingするときでも）として解析される時から、それがそれ自身のものの表現を正しいと考えたので項が予想される所でだけ、fatarrow構成概念が使われるかもしれない。

source: Because the left side is a general expression, the fatarrow form may be used to create a Pair with any value as the key.
ja: 左側が一般表現であるので、fatarrowの形はキーものとして任意の値で一組をつくるのに用いられるかもしれない。

source: On the other hand, when used as above to generate Pair objects, the adverbial forms are restricted to the use of identifiers as keys.
ja: 他方、上記のようにPairオブジェクトを生み出すのに用いられるとき、副詞形はキーとして鑑定人の利用に制限される。

source: You must use the fatarrow form to generate a Pair where the key is not an identifier.
ja: あなたは、キーが識別子でないPairを生み出すために、fatarrowの形を使用しなければならない。

source: Despite that restriction, it's possible for other things to come between a colon and its brackets;
ja: その規制にもかかわらず、他のものがコロンとそのブラケットの間に入ることは、あり得る;

source: however, all of the possible non-identifier adverbial keys are reserved for special syntactical forms.
ja: しかし、あり得る非識別子副詞のキーの全ては、特別な構文的な形のために予約されている。

source: Perl 6 currently recognizes decimal numbers and the null key.
ja: Perl 6は、現在十進数とヌルキーを認知する。

source: In the following table the first and second columns do not mean the same thing:
ja: 以下のテーブルでは、第一および第二のコラムは、同じものを意味しない：

source: All of the adverbial forms (including the normal ones with identifier keys) are considered special tokens and are recognized in various positions in addition to term position.
ja: 副詞形（識別子キーで通常のものを含む）の全ては、よく考えた特別なトークンで、項位置に加えていろいろな位置で公認である。

source: In particular, when used where an infix would be expected they modify the previous topmost operator that is tighter in precedence than &quot;loose unary&quot; (see S03):
ja: 特に、使われるとき、挿入辞があるところはそれらが「自由に単一体である」（S03を見る）より、優先順位できつい前の一番上の演算子を修正すると予想した：

source: Within declarations the adverbial form is used to rename parameter declarations:
ja: 宣言の範囲内で、副詞形はパラメタ宣言の名前を変えるのに用いられる：

source: Adverbs modify the meaning of various quoting forms:
ja: 副詞は、いろいろな引合いに出している形の意味を修正する：

source: When appended to an identifier (that is, in postfix position), the adverbial syntax is used to generate unique variants of that identifier;
ja: 識別子（つまり、接尾辞位置で）に付加されたとき、副詞の構文はその識別子のユニークな変形を生み出すのに用いられる;

source: this syntax is used for naming operators such as infix:&lt;+&gt; and multiply-dispatched grammatical rules such as statement_control:if.
ja: この構文が、命名演算子（例えばstatement_control:ifのようなinfix:&lt;+&gt;と掛算を送られた構文規則）のために使われる。

source: When so used, the adverb is considered an integral part of the name, so infix:&lt;+&gt; and infix:&lt;-&gt; are two different operators.
ja: とても使われるとき、副詞は名前のよく考えた構成要素であるので、infix:&lt;+&gt;とinfix:&lt;-&gt;は2人の異なる演算子である。

source: Likewise prefix:&lt;+&gt; is different from infix:&lt;+&gt;.
ja: 同様に、prefix:&lt;+&gt;はinfix:&lt;+&gt;と異なる。

source: (The notation also has the benefit of grouping distinct identifiers into easily accessible sets;
ja: （表記法も、簡単にアクセスできるセットにグループ異なった識別子の助けをかりる;

source: this is how the standard Perl 6 grammar knows the current set of infix operators, for instance.)
ja: これは、たとえば、標準的なPerl 6文法がインフィックスオペレータの現在のセットを知っている方法である。）

source: Only identifiers that produce a list of one or more values (preferably strings) are allowed as name extensions;
ja: 一つ以上の値（望ましくは文字列）のリストを提示する鑑定人だけは、名前拡張として許される;

source: in particular, closures do not qualify as values, so the :... form is not allowed as a name extender.
ja: 特に、クロージャは値としての資格を得ないので、:...の形は名前増量剤として許されない。

source: In particular, this frees up the block form after a method name, so it allows us to parse a block as a method argument:
ja: 特に、これはメソッド名の後ブロックの形を解放するので、それは我々がメソッド引数としてブロックを解析するのを許す：

source: These might look like it is using pairs, but it is really equivalent to
ja: それのようなこれらの力ルックは組を使っている、しかし、それは本当に等しい

source: and the colons are not introducing pairs, but rather introducing the argument list of the method.
ja: そして、コロンは一組を導入していなくて、メソッドの引数の並びをむしろ導入している。

source: (In any other location, :... would be taken as a pair mapping the null key to a closure.)
ja: （他のどの場所でも、:...はヌルキーをクロージャにマップしている一組としてされる。）

source: Either fatarrow or adverbial pair notation may be used to pass named arguments as terms to a function or method.
ja: fatarrowか副詞の一組表記法は、関数またはメソッドへの項として名をつけられた引数を通過するのに用いられるかもしれない。

source: After a call with parenthesized arguments, only the adverbial syntax may be used to pass additional arguments.
ja: 括弧に入れられた引数による呼び出しの後、副詞の構文だけは、更なる引数を通過するのに用いられるかもしれない。

source: This is typically used to pass an extra block:
ja: これは、余分のブロックを通り過ぎるのに典型的に用いられる：

source: This just naturally falls out from the preceding rules because the adverbial block is in operator position, so it modifies the &quot;find operator&quot;.
ja: 副詞のブロックが演算子位置にあるので、これは前の規則からちょうど自然に抜けるので、それは「検索演算子」を修正する。

source: (Parens aren't considered an operator.)
ja: （括弧は演算子と考えられない。）

source: Note that (as usual) the ... form (either identifier-based or special) can indicate either a closure or a hash depending on the contents.
ja: ...の形（識別子ベースであるか特別な）が内容に従いクロージャかハッシュを示すことができる点に（通常通り）注意しなさい。

source: It does not indicate a subscript, since :key is really equivalent to key =&gt; , and the braces are not behaving as a postfix at all.
ja: :keyがkey =&gt; に本当に等しい時から、それは添え字を示さない、そして、ブレースはまったく接尾辞としてふるまっていない。

source: (The function to which it is passed can use the value as a subscript if it chooses, however.)
ja: （しかし、それが選択をするならば、それが通過される関数は添え字として値を使うことができる。）

source: Note also that the &lt;a b&gt; form is not a subscript and is therefore equivalent not to .'a','b' but rather to ('a','b').
ja: また、&lt;a b&gt;の形が添え字でなくて、したがって、.'a','b'にでなくむしろ('a','b')に等しい点に注意しなさい。

source: Bare &lt;a&gt; turns into ('a') rather than ('a',).
ja: 裸の&lt;a&gt;は、('a',)よりもむしろ('a')に変わる。

source: (However, as with the other bracketed forms, the value may end up being used as a subscript depending on context.)
ja: （しかし、他の括弧に入れられた形と同様に、値は結局前後関係に従う添え字として使われることになるかもしれない。）

source: Two or more adverbs can always be strung together without intervening punctuation anywhere a single adverb is acceptable.
ja: 副詞が常にそうであることがありえる二個以上は、一つの副詞が許容できる場所を中の句読点なしでつなぎ合わせた。

source: When used as named arguments in an argument list, you may put comma between, because they're just ordinary named arguments to the function, and a fatarrow pair would work the same.
ja: 引数の並びの名をつけられた引数として使われるとき、それらが関数とfatarrowへの一組が同じものを動かすという引数という名のちょうど普通であるので、あなたはコンマを置くかもしれない。

source: However, this comma is allowed only when the first pair occurs where a term is expected.
ja: しかし、項が予想される所で最初の一組が起こる時だけ、このコンマは許される。

source: Where an infix operator is expected, the adverb is always taken as modifying the nearest preceding operator that is not hidden within parentheses, and if you string together multiple such pairs, you may not put commas between, since that would cause subsequent pairs to look like terms.
ja: インフィックスオペレータが待たれている所で、括弧の範囲内で隠されない最も近い前の演算子を修正するように、副詞は常にとられる、そして、あなたがチェーン店をつなぎ合わせる、そのような一組、それが以降の組が項のように見える原因になる時から、コンマを置かなくてもよい。

source: (The fatarrow form is not allowed at all in operator position.) See S06 for the use of adverbs as named arguments.
ja: 挙げられた引数として副詞の用法については、S06を見なさい。（fatarrowの形は、交換台でまったく許されない。）

source: The negated form (:!a) and the sigiled forms (:$a, :@a, :%a) never take an argument and don't care what the next character is.
ja: 否定された形（:!a）とsigiledされた形（:$a、:@a、:%a）は、引数を決してしなくて、次の文字が何であるかについて、気にしない。

source: They are considered complete.
ja: それらは、完全であると考えられる。

source: These forms require an identifier to serve as the key.
ja: これらの形は、キーとして用いられることを識別子に要求する。

source: For identifiers that take a numeric argument, it is allowed to abbreviate, for example, :sweet(16) to :16sweet.
ja: 数の引数をする識別子のために、それは、たとえば、:sweet(16)を:16sweetと略すのを許される。

source: (This is distinguishable from the :16&lt;deadbeef&gt; form, which never has an alphabetic character following the number.) Only literal decimal numbers may be swapped this way.
ja: 文字通りの十進数だけは、このように交換されるかもしれない（これは、:16&lt;deadbeef&gt;の形と区別できる。そして、それは数の後、英字を決して持っていない。）。

source: Please note that this abbreviation allows:
ja: この省略形が以下を許す点に注意してください：

source: The other forms of adverb (including the bare :a form) always look for an immediate bracketed argument, and will slurp it up.
ja: 副詞（裸の:aの形を含む）の他の形は、常に即時の括弧に入れられた引数を探して、それを上へ音をたてて飲む。

source: If that's not intended, you must use whitespace between the adverb and the opening bracket.
ja: それが意図されないならば、あなたは副詞と左大括弧の間で空白文字を使わなければならない。

source: The syntax of individual adverbs is the same everywhere in Perl 6.
ja: 個々の副詞の構文は、至る所でPerl 6の同じことである。

source: There are no exceptions based on whether an argument is wanted or not.
ja: 引数が求められているかどうかに基づく例外が、ない。

source: (There is a minor exception for quote and regex adverbs, which accept only parentheses as their bracketing operator, and ignore other brackets, which must be placed in parens if desired.
ja: （引用のためのマイナーな例外と正規表現副詞がある。そして、それは括弧だけを彼らの括弧に入れている演算子と認めて、他のブラケットを無視する。そして、それは必要に応じて括弧に置かれなければならない。

source: See &quot;Paren form&quot; in the table above.)
ja: 上の表で、「括弧の形」を見なさい。）

source: Except as noted above, the parser always looks for the brackets.
ja: 上記したように以外は、構文解析器は常にブラケットを探す。

source: Despite not indicating a true subscript, the brackets are similarly parsed as postfix operators.
ja: 正確な添え字を示さないことにもかかわらず、ブラケットは後置演算子として同じように解析される。
